### Week 3

- Tidy Data
- Pivot & Melt
- Difference Between Pivot and Pivot Table
- Merging Data Frames

## Tidy Data

* each row is a single observation,
* each column is a single variable, and
* each value is a single cell (i.e., its entry in the data frame is not shared with another value).

- The concept stems from a paper written by Hadley Wickham in 2014.

- We tidy our data to create a standard across multiple analysis tools.

![](https://datasciencebook.ca/_main_files/figure-html/02-tidy-image-1.png)

## What to do when data is not tidy...

Data sometimes comes in tables that are easy to read/make sense for humans.

They are not necessarily the best format for computers. Sometimes they can also not provide the information very straight forward.

## Wide to Long

## Goal

![](https://datasciencebook.ca/img/pivot_functions/pivot_functions.001.jpeg)

## Discussion

Why do we do this? 

- Looking at the table, which city has the largest population and in what year was it?

What do you think we could do to make it even easier to find?

## From long to wide

![](https://datasciencebook.ca/img/pivot_functions/pivot_functions.002.jpeg)

### How to Manipulate Long and Wide Tables In Python

### Melt

> wide to long format

[Documentation](https://pandas.pydata.org/docs/reference/api/pandas.melt.html)

![](https://pandas.pydata.org/docs/_images/reshaping_melt.png)

In [1]:
import pandas as pd

cereal = pd.read_csv('https://raw.githubusercontent.com/UBC-MDS/programming-in-python-for-data-science/master/data/cereal.csv')
cereal = cereal.drop(labels=['type', 'shelf', 'weight', 'cups', 'rating'], axis=1)
cereal.head()

,name,mfr,calories,protein,fat,sodium,fiber,carbo,sugars,potass,vitamins
0,100% Bran,N,70,4,1,130,10.0,5.0,6,280,25
1,100% Natural Bran,Q,120,3,5,15,2.0,8.0,8,135,0
2,All-Bran,K,70,4,1,260,9.0,7.0,5,320,25
3,All-Bran with Extra Fiber,K,50,4,0,140,14.0,8.0,0,330,25
4,Almond Delight,R,110,2,2,200,1.0,14.0,8,1,25

In [2]:
cereal[cereal['name'] == '100% Bran']

,name,mfr,calories,protein,fat,sodium,fiber,carbo,sugars,potass,vitamins
0,100% Bran,N,70,4,1,130,10.0,5.0,6,280,25

In [3]:
cereal_long = cereal.melt(id_vars=['name', 'mfr'])
cereal_long[cereal_long['name'] == '100% Bran']

          name mfr  variable  value
0    100% Bran   N  calories   70.0
77   100% Bran   N   protein    4.0
154  100% Bran   N       fat    1.0
231  100% Bran   N    sodium  130.0
308  100% Bran   N     fiber   10.0
385  100% Bran   N     carbo    5.0
462  100% Bran   N    sugars    6.0
539  100% Bran   N    potass  280.0
616  100% Bran   N  vitamins   25.0

### Pivot

> long to wide

[Documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.pivot.html)


![](https://pandas.pydata.org/docs/_images/reshaping_pivot.png)

In [4]:
lego = pd.read_csv('https://raw.githubusercontent.com/UBC-MDS/programming-in-python-for-data-science/master/data/lego_untidy.csv')
lego.head()

  set_num                          name  year  lego_info  value
0    00-1               Weetabix Castle  1970   theme_id    414
1    00-1               Weetabix Castle  1970  num_parts    471
2    00-2  Weetabix Promotional House 1  1976  num_parts    147
3    00-2  Weetabix Promotional House 1  1976   theme_id    413
4    00-3  Weetabix Promotional House 2  1976  num_parts    149

In [5]:
lego_tidy = lego.pivot(index='set_num',
                       columns='lego_info',
                       values='value')
lego_tidy.head()

lego_info  num_parts  theme_id
set_num
00-1             471       414
00-2             147       413
00-3             149       413
00-4             126       413
00-6               3        67

In [6]:
lego_tidy = lego.pivot(index=['set_num', 'name'],
                       columns='lego_info',
                       values='value')
lego_tidy.head()

lego_info                              num_parts  theme_id
set_num name
00-1    Weetabix Castle                      471       414
00-2    Weetabix Promotional House 1         147       413
00-3    Weetabix Promotional House 2         149       413
00-4    Weetabix Promotional Windmill        126       413
00-6    Special Offer                          3        67

In [7]:
lego_tidy2 = lego_tidy.reset_index()
lego_tidy2

lego_info,set_num,name,num_parts,theme_id
0,00-1,Weetabix Castle,471,414
1,00-2,Weetabix Promotional House 1,147,413
2,00-3,Weetabix Promotional House 2,149,413
3,00-4,Weetabix Promotional Windmill,126,413
4,00-6,Special Offer,3,67
...,...,...,...,...
11668,tominifigs-1,Town Minifig Packs 2-Pack,2,50
11669,trucapam-1,Captain America Mosaic,71,598
11670,tsuper-1,Technic Super Set,3,12
11671,vwkit-1,Volkswagen Kit,22,366
11672,wwgp1-1,Wild West Limited Edition Gift Pack,3,476

In [8]:
# What if I want to use the name?
lego.pivot(index='name',
           columns='lego_info',
           values='value')

ValueError: Index contains duplicate entries, cannot reshape

In [9]:
lego_tidy3 = lego.pivot_table(index=['name', 'set_num'],
           columns='lego_info',
           values='value')
lego_tidy3

lego_info                                   num_parts  theme_id
name                             set_num
 1 stud Blue Storage Brick       5003565-1          0       501
 Scenery and Dagger Trap polybag 5002919-1         25       435
 Spectre                         71010-7            7       552
 White Spaceman Key Chain        852815-1           0       503
'Where Are My Pants?' Guy        71004-13           6       549
...                                               ...       ...
{Red Race Car Number 3}          1477-1            39        82
{Roadplates and Scenery}         9360-1            85       533
{Rock Saw Vehicle}               1275-1            22       442
{Town Vehicles}                  1062-1           158       533
{Yellow Cab}                     40025-1           44        22

[11673 rows x 2 columns]

In [10]:
lego_tidy3.reset_index().value_counts('name')

name
Basic Building Set                                     55
Universal Building Set                                 32
Helicopter                                             23
Basic Set                                              23
Fire Station                                           14
                                                       ..
FIRST LEGO League Challenge 2010 - Body Forward v46     1
FIRST LEGO League Challenge 2011 - Food Factor          1
FIRST LEGO League Challenge 2012 - Senior Solutions     1
FIRST LEGO League Challenge 2013 - Nature's Fury        1
{Yellow Cab}                                            1
Length: 10370, dtype: int64

In [11]:
lego_tidy3 = lego_tidy3.reset_index()
lego_tidy3[lego_tidy3['name']=='Basic Building Set'].head(3)

lego_info                name set_num  num_parts  theme_id
1769       Basic Building Set   010-3         77       366
1770       Basic Building Set   011-1        145       366
1771       Basic Building Set   022-1        110       366

In [16]:
bbset = lego.pivot_table(index='name',
           columns='lego_info',
           values='value').reset_index()
bbset
bbset[bbset['name']=="Basic Building Set"]

lego_info                name   num_parts    theme_id
1663       Basic Building Set  216.672727  454.363636

In [18]:
lego_tidy3[lego_tidy3['name']=='Basic Building Set'].describe()

lego_info   num_parts    theme_id
count       55.000000   55.000000
mean       216.672727  454.363636
std        181.916959   34.062776
min         22.000000  366.000000
25%         64.000000  467.000000
50%        176.000000  467.000000
75%        322.500000  467.000000
max        721.000000  470.000000

## Merging Data Frames

In [19]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'id' : [1,2,1,2],
                   'Max Speed': [390., 370., 24., 26.]})

df_food = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                                   'Parrot', 'Parrot'],
                        'id' : [1,2,1,2],
                        'Food': ['Dry', 'Meat', 'Seeds', 'Fruits']})

In [20]:
df.head()

   Animal  id  Max Speed
0  Falcon   1      390.0
1  Falcon   2      370.0
2  Parrot   1       24.0
3  Parrot   2       26.0

In [21]:
df_food

   Animal  id    Food
0  Falcon   1     Dry
1  Falcon   2    Meat
2  Parrot   1   Seeds
3  Parrot   2  Fruits

In [24]:
df_food.merge(df, on = 'Animal')

   Animal  id_x    Food  id_y  Max Speed
0  Falcon     1     Dry     1      390.0
1  Falcon     1     Dry     2      370.0
2  Falcon     2    Meat     1      390.0
3  Falcon     2    Meat     2      370.0
4  Parrot     1   Seeds     1       24.0
5  Parrot     1   Seeds     2       26.0
6  Parrot     2  Fruits     1       24.0
7  Parrot     2  Fruits     2       26.0

In [23]:
df.merge(df_food, on = ['Animal', 'id'])

   Animal  id  Max Speed    Food
0  Falcon   1      390.0     Dry
1  Falcon   2      370.0    Meat
2  Parrot   1       24.0   Seeds
3  Parrot   2       26.0  Fruits

In [25]:
df = pd.DataFrame({'an': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Id' : [1,2,1,2],
                   'Max Speed': [380., 370., 24., 26.]})
df_food = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                                   'Parrot', 'Parrot'],
                        'id' : [1,2,1,2],
                        'Food': ['Dry', 'Meat', 'Seeds', 'Fruits']})

In [26]:
df

       an  Id  Max Speed
0  Falcon   1      380.0
1  Falcon   2      370.0
2  Parrot   1       24.0
3  Parrot   2       26.0

In [27]:
df_food

   Animal  id    Food
0  Falcon   1     Dry
1  Falcon   2    Meat
2  Parrot   1   Seeds
3  Parrot   2  Fruits

In [20]:
df_animal = pd.DataFrame({'an': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Id' : [1,2,1,2],
                   'Max Speed': [380., 370., 24., 26.]})

In [21]:
df

   Animal  id  Max Speed
0  Falcon   1      390.0
1  Falcon   2      370.0
2  Parrot   1       24.0
3  Parrot   2       26.0

In [22]:
df_food

   Animal  id    Food
0  Falcon   1     Dry
1  Falcon   2    Meat
2  Parrot   1   Seeds
3  Parrot   2  Fruits

In [25]:
import pandas as pd
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'id' : [1,2,1, 1 ,2],
                   'Max Speed': [390., 350, 370., 24., 26.]})

df_food = pd.DataFrame({'Animal': ['Falcon', 'Falcon','Parrot', 'Parrot'
                                   ],
                        'id' : [1,2,1,2],
                        'Food': ['Dry', 'Meat', 'Seeds', 'Fruits']})

In [26]:
df

   Animal  id  Max Speed
0  Falcon   1      390.0
1  Falcon   2      350.0
2  Falcon   1      370.0
3  Parrot   1       24.0
4  Parrot   2       26.0

In [27]:
df_food

   Animal  id    Food
0  Falcon   1     Dry
1  Falcon   2    Meat
2  Parrot   1   Seeds
3  Parrot   2  Fruits

In [28]:
df.merge(df_food, on = ['Animal', 'id'])

   Animal  id  Max Speed    Food
0  Falcon   1      390.0     Dry
1  Falcon   1      370.0     Dry
2  Falcon   2      350.0    Meat
3  Parrot   1       24.0   Seeds
4  Parrot   2       26.0  Fruits

In [29]:
pd.concat([df, df_food])

   Animal  id  Max Speed    Food
0  Falcon   1      390.0     NaN
1  Falcon   2      350.0     NaN
2  Falcon   1      370.0     NaN
3  Parrot   1       24.0     NaN
4  Parrot   2       26.0     NaN
0  Falcon   1        NaN     Dry
1  Falcon   2        NaN    Meat
2  Parrot   1        NaN   Seeds
3  Parrot   2        NaN  Fruits

In [30]:
pd.concat([df, df_food], axis = 1)

   Animal  id  Max Speed  Animal   id    Food
0  Falcon   1      390.0  Falcon  1.0     Dry
1  Falcon   2      350.0  Falcon  2.0    Meat
2  Falcon   1      370.0  Parrot  1.0   Seeds
3  Parrot   1       24.0  Parrot  2.0  Fruits
4  Parrot   2       26.0     NaN  NaN     NaN

In [31]:
df_food

   Animal  id    Food
0  Falcon   1     Dry
1  Falcon   2    Meat
2  Parrot   1   Seeds
3  Parrot   2  Fruits

In [32]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon', 'Parrot', 'Parrot'],
                   'Id' :    [1,2,1,2],
                   'Max Speed': [380., 370., 24., 26.]})
df2 = pd.DataFrame({'Animal': ['Tiger', 'Tiger', 'Parrot', 'Rooster'],
                        'Id' : [1,2,1,2],
                        'Max Speed': [500., 470., 24., 46.]})

In [33]:
df

   Animal  Id  Max Speed
0  Falcon   1      380.0
1  Falcon   2      370.0
2  Parrot   1       24.0
3  Parrot   2       26.0

In [34]:
df2

    Animal  Id  Max Speed
0    Tiger   1      500.0
1    Tiger   2      470.0
2   Parrot   1       24.0
3  Rooster   2       46.0

## Difference between Outer Merge and Concat

In [35]:
pd.concat([df, df2])

    Animal  Id  Max Speed
0   Falcon   1      380.0
1   Falcon   2      370.0
2   Parrot   1       24.0
3   Parrot   2       26.0
0    Tiger   1      500.0
1    Tiger   2      470.0
2   Parrot   1       24.0
3  Rooster   2       46.0

In [36]:
df.merge(df2, how="outer")

    Animal  Id  Max Speed
0   Falcon   1      380.0
1   Falcon   2      370.0
2   Parrot   1       24.0
3   Parrot   2       26.0
4    Tiger   1      500.0
5    Tiger   2      470.0
6  Rooster   2       46.0